var Crypt;

Crypt = Crypt || {};

Crypt.l18n = {
  Login: {
    AutoCity: "Город определен автоматически!<br>В случае если произошла<br>ошибка, выберите город<br>самостоятельно, из списка.",
    SuccessReg: {
      title: 'Благодарим Вас за регистрацию!',
      text: 'Ура, вы теперь в Cryptogramm, осталось только войти в систему!<br>Для этого воспользуйтесь формой авторизации'
    },
    ErrorReg: {
      title: 'Произошла ошибка!',
      text: 'При регистрации вашей учетной записи произошла ошибка. Приносим свои<br>извинения за предоставленные неудобства. Повторите попытку регистрации чуть<br>позже. Cryptogramm очень жаль, что это случилось именно с вами, обычно мы<br>работам хорошо...'
    },
    LoginMaxCount: 'Превышено максимальное количество попыток.<br>Пройдите процедуру регистрации с начала',
    RegMaxCount: 'Превышено максимальное количество попыток.<br>Пройдите процедуру регистрации с начала',
    EnterCode: 'Введите код',
    WrongCode: 'Неверный код',
    ErrorRepeat: 'Произошла ошибка, попробуйте повторить попытку'
  },
  Profile: {
    WelcomeModalFirst: {
      title: 'Благодарим Вас за регистрацию!',
      text: 'Ура, теперь Вы в Cryptogramm, осталось выполнить всего<br>несколько действий для того, чтобы воспользоваться всеми<br>преимуществами нашего сервиса!'
    },
    WelcomeModalSecond: {
      title: 'Рады снова видеть Вас в Cryptogramm!',
      text: 'Вам осталось выполнить всего несколько действий для того,<br>чтобы воспользоваться всеми преимуществами нашего сервиса!'
    }
  },
  Date: {
    1: 'января',
    2: 'февраля',
    3: 'марта',
    4: 'апреля',
    5: 'мая',
    6: 'июня',
    7: 'июля',
    8: 'августа',
    9: 'сентября',
    10: 'октября',
    11: 'ноября',
    12: 'декбря'
  },
  Feedback: {
    Success: 'Благодарим Вас за обращение.<br>Наши специалисты обязательно свяжутся с Вами<br>в ближайшее время.',
    Error: 'При отправке сообщения произошла<br>ошибка! Нам очень жаль, что это<br>произошло именно с вами. Повторите<br>попытку позже и у Вас все получится!'
  },
  NewCertificate: {
    error: 'Во время выполнения операции выпуска тестового сертификат произошла ошибка. Сертификат не был создан и не был добавлен в профиль. Повторите процедуру позже.',
    needConfirmEmail: 'Внимание! Для того чтобы выпустить тестовый сертификат необходимо подтвердить Ваш E-mail. Для этого перейдите по ссылке, отправленной на Ваш E-mail, который Вы указали при регистрации.'
  }
};
